# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [ ]:
# import libraries here

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [ ]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [ ]:
# your code here

#### What's the highest salary?

In [ ]:
# your code here

#### What's the lowest salary?

In [ ]:
# your code here

#### Who are the employees with the lowest salary?

In [ ]:
# your code here

#### Find all the information about an employee called David.

In [ ]:
# your code here

#### Could you return only David's salary?

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [ ]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [ ]:
# Method 1
# your code here

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [ ]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [ ]:
# your code here

####  What is the average salary per title?

In [ ]:
# your code here

####  Find the salary quartiles.

In [ ]:
# your code here

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [6]:
import pandas as pd
orders = pd.read_csv("orders.csv", sep=";")
orders.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [7]:
orders.dtypes

index             int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [8]:
orders.describe()

,index,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,198961.500000,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,114870.908596,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,99480.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,198961.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,298442.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,397923.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
It just make sense to look at the statistics form Quantity, UnitPrice and amount_spent as the one for the other
numbers are meaningless.
By looking at the UnitPrice we can see that the price of articles bought is usually small as the 75% quantile is 3.75
So we can see that most of the articles sold are quite cheap.

The quantity by order is on average of 13 but there can be some big orders of up to 81000

The amount spent in an order is usually low as the 75% precentile is 19.8

As a conclusion you can say that this company mostly sells articles that are quite cheap with some big orders but most 
of them are small in quantity

"""

####  What is the average purchase price?

In [ ]:
# It is the mean of amount spent = 22.4

#### What are the highest and lowest purchase prices?

In [ ]:
# The lower purchase price in the database is of 0 (which could be an error or an article that is being replaced for
# free after being damaged) and the highest is 168469.6

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [27]:
 orders[["CustomerID", "Country"]].head()

   CustomerID         Country
0       17850  United Kingdom
1       17850  United Kingdom
2       17850  United Kingdom
3       17850  United Kingdom
4       17850  United Kingdom

In [28]:
orders_grouped_customer = orders[["CustomerID", "Country"]].groupby(["CustomerID"])

In [35]:
orders[["CustomerID", "Country"]].groupby(["CustomerID"]).head()

        CustomerID         Country
0            17850  United Kingdom
1            17850  United Kingdom
2            17850  United Kingdom
3            17850  United Kingdom
4            17850  United Kingdom
9            13047  United Kingdom
10           13047  United Kingdom
11           13047  United Kingdom
12           13047  United Kingdom
13           13047  United Kingdom
26           12583          France
27           12583          France
28           12583          France
29           12583          France
30           12583          France
46           13748  United Kingdom
65           15100  United Kingdom
82           15291  United Kingdom
83           15291  United Kingdom
86           14688  United Kingdom
87           14688  United Kingdom
88           14688  United Kingdom
89           14688  United Kingdom
90           14688  United Kingdom
105          17809  United Kingdom
106          15311  United Kingdom
107          15311  United Kingdom
108          15311  United Kingdom
109          15311  United Kingdom
110          15311  United Kingdom
...            ...             ...
393948       15471  United Kingdom
393949       15471  United Kingdom
393950       15471  United Kingdom
394882       14520  United Kingdom
394883       14520  United Kingdom
394884       14520  United Kingdom
394965       13436  United Kingdom
394966       13436  United Kingdom
394967       13436  United Kingdom
394968       13436  United Kingdom
394969       13436  United Kingdom
395041       15520  United Kingdom
395042       15520  United Kingdom
395043       15520  United Kingdom
395044       15520  United Kingdom
395045       15520  United Kingdom
395582       17436  United Kingdom
395777       13298  United Kingdom
395778       13298  United Kingdom
396506       14569  United Kingdom
396507       14569  United Kingdom
396508       14569  United Kingdom
396509       14569  United Kingdom
396510       14569  United Kingdom
397451       16446  United Kingdom
397783       12713         Germany
397784       12713         Germany
397785       12713         Germany
397786       12713         Germany
397787       12713         Germany

[21090 rows x 2 columns]

In [34]:
orders[["CustomerID", "Country"]].groupby(["CustomerID"]).value_counts

AttributeError: 'DataFrameGroupBy' object has no attribute 'value_counts'

In [25]:
# I group the dataframe by CustomerID
orders_grouped_customer = orders[["CustomerID", "Country"]].groupby(["CustomerID"])
orders_grouped_customer.head()

        CustomerID         Country
0            17850  United Kingdom
1            17850  United Kingdom
2            17850  United Kingdom
3            17850  United Kingdom
4            17850  United Kingdom
9            13047  United Kingdom
10           13047  United Kingdom
11           13047  United Kingdom
12           13047  United Kingdom
13           13047  United Kingdom
26           12583          France
27           12583          France
28           12583          France
29           12583          France
30           12583          France
46           13748  United Kingdom
65           15100  United Kingdom
82           15291  United Kingdom
83           15291  United Kingdom
86           14688  United Kingdom
87           14688  United Kingdom
88           14688  United Kingdom
89           14688  United Kingdom
90           14688  United Kingdom
105          17809  United Kingdom
106          15311  United Kingdom
107          15311  United Kingdom
108          15311  United Kingdom
109          15311  United Kingdom
110          15311  United Kingdom
...            ...             ...
393948       15471  United Kingdom
393949       15471  United Kingdom
393950       15471  United Kingdom
394882       14520  United Kingdom
394883       14520  United Kingdom
394884       14520  United Kingdom
394965       13436  United Kingdom
394966       13436  United Kingdom
394967       13436  United Kingdom
394968       13436  United Kingdom
394969       13436  United Kingdom
395041       15520  United Kingdom
395042       15520  United Kingdom
395043       15520  United Kingdom
395044       15520  United Kingdom
395045       15520  United Kingdom
395582       17436  United Kingdom
395777       13298  United Kingdom
395778       13298  United Kingdom
396506       14569  United Kingdom
396507       14569  United Kingdom
396508       14569  United Kingdom
396509       14569  United Kingdom
396510       14569  United Kingdom
397451       16446  United Kingdom
397783       12713         Germany
397784       12713         Germany
397785       12713         Germany
397786       12713         Germany
397787       12713         Germany

[21090 rows x 2 columns]

In [26]:

# I look at the amount of CustomerID 's that are from spain
orders_grouped_customer["Country"].value_counts()

CustomerID  Country
12346       United Kingdom      1
12347       Iceland           182
12348       Finland            31
12349       Italy              73
12350       Norway             17
12352       Norway             85
12353       Bahrain             4
12354       Spain              58
12355       Bahrain            13
12356       Portugal           59
12357       Switzerland       131
12358       Austria            19
12359       Cyprus            248
12360       Austria           129
12361       Belgium            10
12362       Belgium           266
12363       Unspecified        23
12364       Belgium            85
12365       Cyprus             22
12367       Denmark            11
12370       Cyprus            159
            Austria             8
12371       Switzerland        63
12372       Denmark            52
12373       Austria            14
12374       Austria            33
12375       Finland            17
12377       Switzerland        77
12378       Switzerland       219
12379       Belgium            40
                             ...
18242       United Kingdom     78
18245       United Kingdom    175
18246       United Kingdom      4
18248       United Kingdom     47
18249       United Kingdom      8
18250       United Kingdom     21
18251       United Kingdom     16
18252       United Kingdom     98
18255       United Kingdom      6
18257       United Kingdom    118
18259       United Kingdom     42
18260       United Kingdom    134
18261       United Kingdom     21
18262       United Kingdom     13
18263       United Kingdom     61
18265       United Kingdom     46
18268       United Kingdom      1
18269       United Kingdom      7
18270       United Kingdom     11
18272       United Kingdom    166
18273       United Kingdom      3
18274       United Kingdom     11
18276       United Kingdom     14
18277       United Kingdom      8
18278       United Kingdom      9
18280       United Kingdom     10
18281       United Kingdom      7
18282       United Kingdom     12
18283       United Kingdom    756
18287       United Kingdom     70
Name: Country, Length: 4347, dtype: int64

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here